Revit 2027 API
FabricSheetType.OverallLength Property
 The length of the wire sheet (including overhangs) in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OverallLength { get; }
Public ReadOnly Property OverallLength As Double
	Get
public:
property double OverallLength {
	double get ();
}
member OverallLength : float with get
Property Value
Double
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace